insert into person(surname, name, patronymic, phone_number, inn)
values
    ('Бочаров', 'Владислав', 'Глебович', '+380996540532', 694210568726),
    ('Гончарова', 'Арина', 'Константиновна', '+380670291574', 659401245060),
    ('Гусев', 'Борис', null, '+380933261502', 912502364872),
    ('Королева', 'Ксения', 'Александровна', '+380503252204', 206544879102),
    ('Петров', 'Роман', 'Максимович', '+380633026054', 540326985212),
    ('Постникова', 'Алина', null, '+380978540263', 740256319582),
    ('Семенов', 'Лев', 'Тимофеевич', '+380995920604', 632014807865),
    ('Сорокин', 'Даниил', 'Максимович', '+380679843587', 315048069715),
    ('Степанова', 'Полина', 'Игоревна', '+380569453087', 845102360984),
    ('Яковлева', 'Татьяна', 'Артёмовна', '+380442305796', 426058931483)
;

insert into bank_account(sum_of_money, person_id)
values
    (123.82, 1),
    (0, 1),
    (1000, 3),
    (8294.90, 4),
    (-10000, 5),
    (100500, 5),
    (0, 5),
    (8023.01, 8),
    (-100.75, 8),
    (0, 9)
;

insert into payment(credit_account, debit_account, transaction_amount)
values
    (100000000005, 100000000007, 234),
    (100000000009, 100000000000, 5294.38),
    (100000000001, 100000000004, 10000)
;
